slides/aug19/present1.html
<?xml version="1.0" encoding="utf-8"?>
<!doctype html>
<html lang="en">
<head>
<meta charset="utf-8"><title>(Testing with Cassandra)</title>
<link rel="stylesheet" href="http://www.pdxcass.org/reveal.js/css/reveal.min.css">
<link rel="stylesheet" href="http://www.pdxcass.org/reveal.js/css/theme/solarized.css" id="theme">

<link rel="stylesheet" href="http://www.pdxcass.org/reveal.js/css/print/pdf.css" type="text/css" media="print">
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Testing with Cassandra</h1>
<h2></h2>
<h2><a href="mailto:gregory.cooper@iovation.com">gregory.cooper@iovation.com</a></h2>
<h2>Aug. 19, 2013</h2></section>
<aside class="notes">
Notes here
</aside>

<section id="sec-1" >

<h2>Welcome</h2>
<ul class="org-ul"><li class="fragment none">Who am I and what's my role?<br/></li>
<li class="fragment none">How is Cassandra being used at iovation<br/><ul class="org-ul">
<li>Several clusters
</li>
<li>Multiple data centers
</li>
<li>"Global" Replication factor of 3 with 1 per data center
</li>
</ul>
<p>
<i>Low latency between data centers  make this interesting, but we have questions</i>
</p>
</li></ul>

</section>
<section id="sec-2" >

<h2>Development Environment</h2>
<ul class="org-ul">
<li>Maven centric
</li>
<li>Mockito is moderately used
</li>
<li>Jenkins (Hudson) continuous integration
</li>
<li>Frequent deployments
</li>
<li>Matching QA environment difficult
</li>
</ul>
<p>
<i>Scale of data makes it hard</i>
</p>

</section>
<section id="sec-3" >

<h2>Cassandra Interaction</h2>
<ul class="org-ul">
<li>Astyanax and some Pelops
</li>
<li>Interested in the binary driver
</li>
<li>1.2.x has binary and Thrift
  <i>Each has an (on/off) toggle</i>
<ul class="org-ul">
<li>Heavily recommended for new clients
(<i>Stopped short of deprecating it</i>)
</li>
<li>Anyone migrated yet?
</li>
</ul>
</li>
</ul>

</section>
<section id="sec-4" >

<h2>Unit Testing</h2>
<ul class="org-ul">
<li>Mockito heavy
</li>
<li>DAO driven
</li>
</ul>
</section>
<section>
<section id="sec-4-1" >

<h3>Mockito Annotation</h3>
<pre class="example">
@RunWith(MockitoJUnitRunner.class)
public class CassandraDrsDaoUnitTest {
...

    CassandraDrsDao dao;
...
    
    @Mock
    PurgePolicyComponent policyComponent;
    
    @Mock
    private Keyspace patternStoreMock;
</pre>
</section>

</section>
<section>
<section id="sec-4-2" >

<h3>Test DAO w/o Persistence</h3>
<pre class="example">
...

    @Before
    public void setup() throws Exception {
...
        dao  = new CassandraDrsDao();
...

   @Test
    public void testReadExclusionListWithEmptyList() throws Exception {
        NuidSet nuidSet = new NuidSet();
        nuidSet.addNuid("nuid1", "value");
...
        ColumnFamilyQuery cfQueryMock = mock(ColumnFamilyQuery.class);
        RowSliceQuery     rsQueryMock = mock(RowSliceQuery.class);
...
        when(rsQueryMock.withColumnSlice(exlucsionColNames)).thenReturn(rsQueryMock);
        when(rsQueryMock.execute()).thenReturn(resultMock);
...        
        dao.readNuidExclusion(nuidSigs, nuidSet);
        verify(exclusionStoreMock, never()).prepareQuery(eq(exclusionColumnFamily));
        assertNotNull(nuidSet.getNuid("nuid1"));
    }
</pre>
</section>

</section>
<section id="sec-5" >

<h2>Integration testing</h2>
<ul class="org-ul">
<li>Testing at a functional level
</li>
<li>Using running Cassandra instance
</li>
</ul>
</section>
<section id="sec-6" >

<h2>Different Approaches</h2>
<ul class="org-ul">
<li>Maven plugin
</li>
<li>Embedded instance
</li>
</ul>
</section>
<section id="sec-7" >

<h2>Maven plugin</h2>
<ul class="org-ul">
<li>Configure your pom
</li>
<li>Running Cassandra instance "just available"
</li>
</ul>
</section>
<section>
<section id="sec-7-1" >

<h3>POM Setup</h3>
<pre class="example">
&lt;build&gt;
    &lt;plugins&gt;
        ...
        &lt;plugin&gt;
            &lt;groupId&gt;com.iovation.maven&lt;/groupId&gt;
            &lt;artifactId&gt;maven-cassandra-plugin&lt;/artifactId&gt;
            &lt;version&gt;1.0.1-SNAPSHOT&lt;/version&gt;
            &lt;executions&gt;
                &lt;execution&gt;
                    &lt;goals&gt;
                        &lt;goal&gt;cassandra-start&lt;/goal&gt;
                        &lt;goal&gt;cassandra-stop&lt;/goal&gt;
                    &lt;/goals&gt;
                &lt;/execution&gt;
            &lt;/executions&gt;
        &lt;/plugin&gt;
        &lt;plugin&gt;
            &lt;groupId&gt;org.apache.maven.plugins&lt;/groupId&gt;
            &lt;artifactId&gt;maven-war-plugin&lt;/artifactId&gt;
            &lt;version&gt;2.0&lt;/version&gt;
            &lt;configuration&gt;
                &lt;warName&gt;service&lt;/warName&gt;
            &lt;/configuration&gt;
        &lt;/plugin&gt;
    &lt;/plugins&gt;
&lt;/build&gt;
</pre>
</section>

</section>
<section id="sec-8" >

<h2>Embedded approach</h2>
<ul class="org-ul">
<li>Jeremy Sevellec's approach for embedding
</li>
</ul>
<p>
Easy to control initial setup and data loading.
</p>

</section>
<section id="sec-9" >

<h2>POM Dependency</h2>
<pre class="example">
&lt;dependency&gt;
    &lt;groupId&gt;org.cassandraunit&lt;/groupId&gt;
    &lt;artifactId&gt;cassandra-unit&lt;/artifactId&gt;
    &lt;version&gt;1.1.0.1&lt;/version&gt;
    &lt;scope&gt;test&lt;/scope&gt;
&lt;/dependency&gt;
</pre>

</section>
<section id="sec-10" >

<h2>Setup and Data load</h2>
<pre class="example">
@RunWith(SpringJUnit4ClassRunner.class)
@DirtiesContext
@ActiveProfiles(profiles = "test")
@ContextConfiguration(classes = {TestPropertyConfiguration.class, DaoConfig.class, CassandraDemandConfiguration.class})
public class TlmArchiveTtlTest {

    @Resource(name = "tlmArchiveTtl")
    private TlmArchiveTtl tlmArchiveTtl;

    @BeforeClass
    public static void setUp() throws Exception {
        // This MUST be fired up before the spring context is created.
        EmbeddedCassandraServerHelper.startEmbeddedCassandra("tatestcassandra.yaml");
        DataLoader dataLoader = new DataLoader("TestCluster", "localhost:9172");
        dataLoader.load(new ClassPathJsonDataSet("clustertestdata.json"));

        dataLoader.load(new ClassPathJsonDataSet("drsindextestdata.json"));
    }
...
</pre>

</section>
<section id="sec-11" >

<h2>Actual Test</h2>
<pre class="example">
@Test
public void testReadWriteSimpleText() throws Exception {
    String testData = "... (omitted json representing transaction here) ...";
    verifyData(testData);
}

private void verifyData(String data) throws Exception {
    TlmArchiveRecord record = new TlmArchiveRecordImpl();
    record.setData(data);

    long testTime = System.currentTimeMillis();
    String uuid = UUID.randomUUID().toString();
    TlmArchiveKey key = new TlmArchiveKeyImpl(testTime, uuid);
    record.setTlmArchiveKey(key);

    tlmArchiveWriter.writeRecord(record);
    assertNotNull(record.getTlmArchiveKey());
    TlmArchiveKey savedKey = record.getTlmArchiveKey();

    TlmArchiveRecord r2 = tlmArchiveReader.readRecord(savedKey);
    assertEquals(data, r2.getData());
}
</pre>

</section>
<section id="sec-12" >

<h2>"Long running" trick</h2>
<pre class="example">
/**
 * Most of the time taken on this comes from killing 3650 column families which take about 1200ms each.
 * So killing 10 years of column families takes about an hour.
 * &lt;p/&gt;
 * Creating the column families isn't especially fast either, about 600ms each - so creating 3650 column families
 * and inserting 87672 records takes about 30 minutes.
 */
@Test
public void testTenYearsOfDataOneMessageAnHour() throws Exception {
    assumeTrue(wantLongRunningTests);
    DateTime startDateTime = new DateTime(1980, 1, 1, 0, 0, 0, 0);
    DateTime endDateTime = new DateTime(1989, 12, 31, 23, 59, 59, 999);

    // the one makes it easy to compare message count to time:
    // the 1234th message will have the last 4 digits of the ms time be 1234
    // and the formatted time will end in 01,234
    int period = 60 * 60 * 1000 + 1;

    verifyInsertRead(startDateTime, endDateTime, period, false);
}
</pre>
<p>
The 'assumeTrue' is the key here
</p>
</section>
<section id="sec-13" >

<h2>System and Cassandra testing</h2>
<ul class="org-ul">
<li>Large scale

<p>
QA as close to production as possible.
</p>
</li>
<li>Small scale

<p>
More like general 'cassandra' testing with a cluster.
</p>
</li>
<li>Current Efforts
</li>
</ul>
</section>
<section id="sec-14" >

<h2>Large Scale Details</h2>
<ul class="org-ul">
<li>Automated teardown and restart

<p>
Around an hour for 24 node cluster
</p>
</li>
<li>Some automated, mostly Manual validation
</li>
<li>Very service/application specific.
</li>
<li>Great for load testing and capacity planning.
</li>
<li>A level of confidence before deployment
</li>
</ul>
</section>
<section id="sec-15" >

<h2>Small Scale Details</h2>
<ul class="org-ul">
<li>Library for cluster spin up and destroying (could be used interactively)

<p>
<i>Touches realm of puppet, chef, juju charms, etc&#x2026;(but 100% JVM based)</i>
</p>
</li>
<li>Proving our Cassandra assumptions
<ul class="org-ul">
<li>Do our procedures for node replacement do what is expected?
</li>
<li>When we upgrade Cassandra are our expectations still met?
</li>
<li>How does Cassandra behave when we have a corrupted SSTable. Can we make a change?
</li>
</ul>
</li>
<li>Currently 'generic', not iovation service specific
</li>
<li>Could be used for integration testing in services
</li>
</ul>

</section>
<section id="sec-16" >

<h2>Cool things</h2>
<ul class="org-ul">
<li>Github pages

<p>
Great way to serve static html pages for free!
</p>
<ul class="org-ul">
<li>Jekyll support for html generation
</li>
</ul>
</li>
<li>Org-reveal <i>for emacs org-mode nerds</i>
<ul class="org-ul">
<li>"Source code" for this reveal.js presentation in 'org-mode'
</li>
</ul>
</li>
</ul>
</section>
<section id="sec-17" >

<h2>Interesting link references</h2>
<ul class="org-ul">
<li><a href="http://mojo.codehaus.org/cassandra-maven-plugin/">Maven Cassandra Testing</a>
</li>
<li><a href="https://github.com/jsevellec/cassandra-unit">Embedded Cassandra Testing Library</a>
</li>
<li><a href="https://github.com/Netflix/astyanax">Astyanax Client</a>
</li>
<li><a href="http://pages.github.com/">GitHub Pages</a>
</li>
<li><a href="http://www.planetcassandra.org/blog/post/iovation-chooses-cassandra-for-predictable-cost-growth-and-scalability">Iovation and Cassandra</a>
</li>

<li><a href="http://lab.hakim.se/reveal-js/#/">reveal.js</a>
</li>
<li><a href="http://orgmode.org/">Org-Mode</a> and <a href="https://github.com/yjwen/org-reveal">Org-Reveal</a>
</li>
</ul>
</section>
<section id="sec-18" >

<h2>Questions/Next meeting</h2>
<ul class="org-ul">
<li>What should we do next?
</li>
<li>Discussion/Volunteers?
</li>
<li>Want to fiddle with github pages?
</li>
<li>Speakers?  Topics
</li>
</ul>

</section>
<section id="sec-19" >

<h2>Thank you</h2>
</section>
</div>
</div>
<script src="http://www.pdxcass.org/reveal.js/lib/js/head.min.js"></script>
<script src="http://www.pdxcass.org/reveal.js/js/reveal.min.js"></script>
<script>

        		// Full list of configuration options available here:
        		// https://github.com/hakimel/reveal.js#configuration
        		Reveal.initialize({
        			controls: true,
        			progress: true,
        			history: true,
        			center: true,
        			rollingLinks: true,
        			keyboard: true,
        			overview: true,
        			 // slide width
        			 // slide height
        			 // slide margin
        			 // slide minimum scaling factor
        			 // slide maximum scaling factor


        			theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
        			transition: Reveal.getQueryHash().transition || 'fade', // default/cube/page/concave/zoom/linear/fade/none
        			transitionSpeed: 'default',

        			// Optional libraries used to extend on reveal.js
        			dependencies: [
        				{ src: 'http://www.pdxcass.org/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
        				{ src: 'http://www.pdxcass.org/reveal.js/plugin/markdown/showdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
        				{ src: 'http://www.pdxcass.org/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
        				{ src: 'http://www.pdxcass.org/reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
        				{ src: 'http://www.pdxcass.org/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
        				{ src: 'http://www.pdxcass.org/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: 'http://www.pdxcass.org/reveal.js/plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: 'http://www.pdxcass.org/reveal.js/plugin/remotes/remotes.js', async: true, condition: function() { return !!document.body.classList; } }
        			]
        		});
</script>
</body>
</html>
